DataProcessors/ОтправкаЦенНаСогласование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтправкаЦенНаСогласование</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрименения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентКанала</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ОтправкаЦенНаСогласование/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Объект.Номенклатура = Параметры.Номенклатура;
	КонецЕсли;
	
	Если Параметры.Свойство("ЦеныНоменклатуры") И Параметры.ЦеныНоменклатуры <> Неопределено Тогда
		ИсточникЦен = Параметры.ЦеныНоменклатуры;
		Если ТипЗнч(ИсточникЦен) <> Тип("ТаблицаЗначений") Тогда
			ИсточникЦен = ИсточникЦен.Выгрузить();
		КонецЕсли;
		Объект.ТаблицаЦен.Загрузить(ИсточникЦен);
	КонецЕсли;
	
	Для Каждого СтрокаЦен Из Объект.ТаблицаЦен Цикл
		СтрокаЦен.ЦенаСтарая = СтрокаЦен.Цена;
	КонецЦикла;
	
	СогласованиеЦенНоменклатурыСервер.ОставитьТипыЦенСогласования(Объект.ТаблицаЦен);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ТекстОшибки = "";
	СсылкаПроцесса = Неопределено;
	Если Не НачатьСогласованиеНаСервере(СсылкаПроцесса, ТекстОшибки) Тогда
		Сообщить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Сообщить("Запущено согласование цен " + СсылкаПроцесса);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенЦенаПриИзменении(Элемент)
	
	ПересчитатьОтКанала5();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенЦенаСНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаЦен.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьЦенуБезНДСНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
	ПересчитатьОтКанала5();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОтКанала5()
	
	ТекстОшибки = "";
	Если Не ПересчитатьОтКанала5НаСервере(ТекстОшибки) Тогда
		Сообщить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьСогласованиеНаСервере(СсылкаПроцесса, ТекстОшибки)
	
	Попытка
		СсылкаПроцесса = СогласованиеЦенНоменклатурыСервер.НачатьСогласование(
			Объект.Номенклатура,
			Объект.ДатаПрименения,
			Объект.ТаблицаЦен.Выгрузить());
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПересчитатьЦенуБезНДСНаСервере(ИдентификаторСтроки)
	
	СтрокаЦен = Объект.ТаблицаЦен.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтавкаНДСЧисло = УчетНДС.ПолучитьСтавкуНДС(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Номенклатура, "СтавкаНДС"));
	СтрокаЦен.Цена = СтрокаЦен.ЦенаСНДС / (1 + СтавкаНДСЧисло / 100);
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьОтКанала5НаСервере(ТекстОшибки)
	
	Попытка
		Таблица = Объект.ТаблицаЦен.Выгрузить();
		СогласованиеЦенНоменклатурыСервер.ПересчитатьЦеныОтКанала5(Таблица, Объект.Номенклатура);
		Объект.ТаблицаЦен.Загрузить(Таблица);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
